"""
print('เลือกเมนูเพื่อทำรายการ\n#################')
print('กด 1 เลิอกเหมาจ่าย')
print('กด 2 เลือกจ่ายเพิ่ม')
ch = int(input('')) #กำหนดวางให้เลือก
if ch == 1 :  #ส่วนที่ 1(ตัวเลือก)
    km1 = int(input('กรุณาบอกระยะทาง')) #กำหนดตัวkm1 เข้ามา
    if km1 <= 25 : #น้อยกว่าหรือเท่ากับ 25
        print('ค่าใช้จ่ายรวมทั้งหมด 25 บาท')
    else:
        print('ค่าใช้จ่ายรวมทั้งหมด 55 บาท') #สิ้นสุดส่วนที่ 1
elif ch == 2 : #ส่วนที่ 2 (ตัวเลือก)
    km2 = int(input('กรุณาบอกระยะทาง')) #กำหนดตัวkm2 เข้ามา
    if km2 < 25 : #ไม่เกิน 25
            print('ค่าใช้จ่ายทั้งหมด 25 บาท')
    else:
        print('ค่าใช้จ่ายรวมทั้งหมด 80 บาท') #สิ้นสุดส่วนที่ 2
"""
