"""age = 25              #ตัวเลขจำนวนเต็ม Integer
wight = 66.6          #ตัวเลขทศนิยม Float
fist_name = 'โฟล์คไง'  #ข้อความ String
has_notebook = True   #Boolean มีค่าเเค่2แบบ คือ True False แต่สำคัญกับการตรวจคำตอบกับการวนลูป
"""
"""
x = '4'  #(string)
y = '12' #(string)
z = x + y
print(z) #การ+กันคือการเอามาต่อกันในทางของข้อความ 
"""
"""
x = int('4') #รับข้อมูลจำนวนเต็ม int คือ integen
y = 12
z = x + y
print(z)
"""

"""
x = float('4.5') #รับข้อมูลที่เป็นทศนิยม float
y = 12
z = x + y
print(z)
"""

"""
x = '4.5'
y = str(12) #อยู่รูปแบบข้อความ stt ย่อมาจาก string 
z = x + y
ptint(z) #ผลที่ได้จะเป็นการมาต่อกันของข้อมความเพราะ 4.5 เป็นข้อความ ผลลัพธ์ได้จึงเป็น 4.512
"""

#เรื่องของเครื่องหมายการคำนวณ
"""
x = 5
y = 2
a1 = x + y   #Ans 7      บวก
a2 = x - y   #Ans 3      ลบ
a3 = x * y   #Ans 10     คูณ
a4 = x / y   #Ans 2.5    หาร
a5 = x % y   #Ans 1      หาเศษที่ได้จาการหาร
a6 = x ** y  #Ans 25     ยกกำลัง 5^2
a7 = x // y  #Ans 2      หารปัดเศษทิ้ง
a8 = (x + 1) * (x - 1)
"""

#เครื่องหมายช็อตคัด
"""
x = 5
x += 3 #ตัวเดียวกับ x = x + 3
"""

#เครื่องหมายการเปรียบเทียบ
"""
x = 8
y = 4

a1 = x > y     # True มากกว่า
a2 = x >= y    # True มากกว่าเท่ากับ

a3 = x < y     # False น้อยกว่า
a4 = x <= y    # False น้อยกว่าหรือเท่ากับ

a5 = x == y    # False เท่่ากับ
a6 = x != y    # False ไม่เท่ากับ
"""

#เครื่องหมายทางตรรกะศาสตร์
"""
p = True
q = Fe

a1 = p and q   # False เเละ โดยต้องเหมือนกัน เช่น True กับ True 
a2 = p or q    # True  หรือ  ขอเเค่มีข้างใดข้างหนึ่่งที่มี Ture
a3 = p not q   # False  การสลับขัั่ว จาก p ที่เป็น Tureจะเปลี่ยนไปเป็น false ส่วนqที่เป็น false จะเปลี่ยนเป็นTrue
"""

#conditions การตรวจสอบเงื่อไข
""" 
โครงสร้าง  if เงื่อนไข:
            ....คำสั่งข้างใน มีกี่คำสั่งก็ได้
"""
"""
score = 85

if score >= 80:
    print('Grade A')
    print('WOW')
"""
"""
โครงสร้าง  eilf  เงื่อนไข
                    ...คำสั่งข้างใน
"""
"""
score = 77
if score >= 80:
    print('Grade A') #ถ้าข้างบนตรวจสอบผ่าน จะไม่ลงมาตรวจสอบ elif ข้างล่างต่อ
    print('WOW')
elif score >= 70:
    print('Grade B')
"""
"""
โครงสร้าง  else:
            ...คำสั่งข้างใน
"""
"""
score = 58
if score >= 80:
    print('Grade A') #ถ้าข้างบนตรวจสอบผ่าน จะไม่ลงมาตรวจสอบ elif ข้างล่างต่อ
    print('WOW')
elif score >= 70:
    print('Grade B')
else: #ไม่ตรงเงื่อนไขจะออกมางนี้
    print('Grade F')
"""

#Loops การทำซ้ำไปซ้ำมา
"""
โครงสร้าง  for ตัวแปร in ชุดข้อมูล
                    ...คำสั่งข้างใน
for i in range(3): #range คือคำสั่ง สร้างลำดับตัวเลขข่้อมูล(ลิมิต ค่าสุดท้ายน้อยกว่าลิมิต)
        print(i) #วิ่งไปรับตั้งแต่ 0 จนถึงลิมิดที่เรากำหนดไว้ คำในสั่งใน for มีกี่คำสั่งก็ได้

#ถ้าไม่อยากให้ range เริ่มที่ 0  สามารถทำได้โดย โครงส้ราง range(ค่าเริ่มต้น , ลิมิด)
for i in range(1, 3):
    print(i)
ตัวอย่าง สมการ คูณ 2
for i in range(1, 4):
    double =i * 2
    print(double)
ต่อไปจะมี continue จะใช้เเค่ใน loop .ใช้ข้ามloopรอบนั้นไป
for i in range(1, 7): 
    if i % 3 == 0:    #เงื่อนไขที่หาร3ลงตัว จะข้ามรอบนี้ไป
        continue   
    print(i)
ต่อไป break ใช้ออกจาก loop หยุดการรทำงานของ Loopนั้นทันที
for i in range(1, 7):
    if i % 3 == 0:
        break
    print(i)
"""
